import Statistics from "../main";
import Extension from "../plugin/extensions";
import { data as d } from '../src/exportData';
/* แบบทดสอบอันใหม่ */

let Stat: Statistics = new Statistics(d.example1.set1.data, [], [], d.example1.set1.weight);
let E: Extension = new Extension([], []);
Stat.showTable('t4');
console.log(Stat.mean());
/*
    ┌─────────┬────────────┬──────────────┬─────────────────────┐
    │ (index) │     x      │      w       │         wx          │
    ├─────────┼────────────┼──────────────┼─────────────────────┤
    │    0    │   'ข้อมูล'   │ 'ค่าถ่วงน้ำหนัก' │ 'ข้อมูล x ค่าถ่วงน้ำหนัก' │
    │    1    │     50     │      30      │        1500         │
    │    2    │     65     │      20      │        1300         │
    │    3    │     70     │      15      │        1050         │
    │    4    │     55     │      20      │        1100         │
    │    5    │     75     │      15      │        1125         │
    │    6    │ 'Σx = 315' │  'Σw = 100'  │    'Σwx = 6075'     │
    └─────────┴────────────┴──────────────┴─────────────────────┘
        สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 5 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 60.75 ≈ 60.75
    ค่าเฉลี่ยเลขคณิต x̄ = 60.75
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 60.75
*/

Stat = new Statistics(d.example1.set2.data);
Stat.showData();
console.log(Stat.mean());
/*
    ข้อมูลเดิมคือ 12 , 18 , 20 , 19 , 15 , 16
    เรียงข้อมูลชุดใหม่ได้ 12 , 15 , 16 , 18 , 19 , 20
    ค่าเฉลี่ยเลขคณิต x̄ = 16.666666666666668
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 16.67
*/

Stat = new Statistics(d.example1.set3.data, d.example1.set3.frequency);
Stat.showTable('t1', 'คะแนน', 'จำนวนคน');
/*
    ┌─────────┬───────────┬───────────┬────────────────┐
    │ (index) │     x     │     f     │       xf       │
    ├─────────┼───────────┼───────────┼────────────────┤
    │    0    │  'คะแนน'  │ 'จำนวนคน' │ 'ข้อมูล x ความถี่' │
    │    1    │     5     │     4     │       20       │
    │    2    │     6     │     6     │       36       │
    │    3    │     7     │     3     │       21       │
    │    4    │     8     │     5     │       40       │
    │    5    │     9     │     2     │       18       │
    │    6    │ 'Σx = 35' │ 'n = 20'  │  'Σxf = 135'   │
    └─────────┴───────────┴───────────┴────────────────┘
        สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 20 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 6.75 ≈ 6.75
*/

Stat = new Statistics([], d.example1.set4.frequency, d.example1.set4.classInterval);
Stat.showTable('t3', 'คะแนน', 'จำนวนคน');
/*
    ┌─────────┬─────────────┬──────────────┬───────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │     f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼───────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'จำนวนคน' │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │   '5 - 9'   │      7       │     3     │      3      │       21       │
    │    2    │  '10 - 14'  │      12      │     5     │      8      │       60       │
    │    3    │  '15 - 19'  │      17      │    10     │     18      │      170       │
    │    4    │  '20 - 24'  │      22      │     7     │     25      │      154       │
    │    5    │  '25 - 29'  │      27      │     5     │     30      │      135       │
    │    6    │    'รวม'    │  'Σx = 85'   │ 'n = 30'  │    ' - '    │  'Σxf = 540'   │
    └─────────┴─────────────┴──────────────┴───────────┴─────────────┴────────────────┘
        สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 30 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 18 ≈ 18.00
*/

Stat = new Statistics(d.example1.set5.data, [], [], d.example1.set5.weight);
Stat.showTable('t4', 'หน่วยกิต', '', '', 'ระดับคะแนน');
/*
    ┌─────────┬───────────┬─────────────┬─────────────────────┐
    │ (index) │     x     │      w      │         wx          │
    ├─────────┼───────────┼─────────────┼─────────────────────┤
    │    0    │ 'หน่วยกิต'  │ 'ระดับคะแนน' │ 'ข้อมูล x ค่าถ่วงน้ำหนัก' │
    │    1    │     3     │      3      │          9          │
    │    2    │     4     │      3      │         12          │
    │    3    │     3     │      2      │          6          │
    │    4    │     2     │      2      │          4          │
    │    5    │     4     │      1      │          4          │
    │    6    │     3     │      2      │          6          │
    │    7    │     3     │      1      │          3          │
    │    8    │ 'Σx = 22' │  'Σw = 14'  │     'Σwx = 44'      │
    └─────────┴───────────┴─────────────┴─────────────────────┘
        สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 7 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 3.142857142857143 ≈ 3.14
*/

Stat = new Statistics(d.example2.set1.data);
Stat.showData();
console.log(Stat.median());
/*
    ข้อมูลเดิมคือ 11 , 15 , 22 , 36 , 11 , 18 , 22 , 22 , 16 , 28
    เรียงข้อมูลชุดใหม่ได้ 11 , 11 , 15 , 16 , 18 , 22 , 22 , 22 , 28 , 36
    ตำแหน่งมัธยฐาน = 18 ระหว่าง 22
    มัธยฐาน Me = 20
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 20.00
*/

Stat = new Statistics(d.example2.set2.data);
Stat.showData();
console.log(Stat.median());
/*
    ข้อมูลเดิมคือ 156 , 152 , 157 , 150 , 155 , 159
    เรียงข้อมูลชุดใหม่ได้ 150 , 152 , 155 , 156 , 157 , 159
    ตำแหน่งมัธยฐาน = 155 ระหว่าง 156
    มัธยฐาน Me = 155.5
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 155.50
*/

Stat = new Statistics(d.example2.set3.data, d.example2.set3.frequency);
Stat.showTable('t1', 'คะแนน');
console.log(Stat.median());
/*
    ┌─────────┬───────────┬──────────┬────────────────┐
    │ (index) │     x     │    f     │       xf       │
    ├─────────┼───────────┼──────────┼────────────────┤
    │    0    │  'คะแนน'  │ 'ความถี่'  │ 'ข้อมูล x ความถี่' │
    │    1    │     8     │    5     │       40       │
    │    2    │     9     │    2     │       18       │
    │    3    │    10     │    1     │       10       │
    │    4    │    11     │    7     │       77       │
    │    5    │    12     │    5     │       60       │
    │    6    │ 'Σx = 50' │ 'n = 20' │  'Σxf = 205'   │
    └─────────┴───────────┴──────────┴────────────────┘
        สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 20 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 10.25 ≈ 10.25
    ตำแหน่งมัธยฐาน = 10
    มัธยฐาน Me = 11
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 11.00
*/

Stat = new Statistics([], d.example2.set4.frequency, d.example2.set4.classInterval);
Stat.showTable('t3');
console.log(Stat.median());
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │   '5 - 9'   │      7       │    4     │      4      │       28       │
    │    2    │  '10 - 14'  │      12      │    5     │      9      │       60       │
    │    3    │  '15 - 19'  │      17      │    6     │     15      │      102       │
    │    4    │  '20 - 24'  │      22      │    10    │     25      │      220       │
    │    5    │  '25 - 29'  │      27      │    15    │     40      │      405       │
    │    6    │    'รวม'    │  'Σx = 85'   │ 'n = 40' │    ' - '    │  'Σxf = 815'   │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 40 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 20.375 ≈ 20.38
    ตำแหน่งมัธยฐาน = 20
    มัธยฐาน Me = 22
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 22.00
*/

Stat = new Statistics(d.example3.set1.data);
Stat.showData();
console.log(Stat.mode());
/*
    ข้อมูลเดิมคือ 4 , 5 , 3 , 2 , 4 , 1 , 5 , 4 , 2 , 1 , 4 , 3
    เรียงข้อมูลชุดใหม่ได้ 1 , 1 , 2 , 2 , 3 , 3 , 4 , 4 , 4 , 4 , 5 , 5
    ฐานนิยม Mo = 4
*/

Stat = new Statistics(d.example3.set2.data);
Stat.showData();
console.log(Stat.mode());
/*
    ข้อมูลเดิมคือ 1 , 2 , 4 , 9 , 9 , 1 , 4 , 2 , 1 , 9 , 2 , 4
    เรียงข้อมูลชุดใหม่ได้ 1 , 1 , 1 , 2 , 2 , 2 , 4 , 4 , 4 , 9 , 9 , 9
    ไม่มีค่าฐานนิยมของข้อมูลชุดนี้
*/

Stat = new Statistics(d.example3.set3.data);
Stat.showData();
let mode = Stat.mode();
Stat = new Statistics(d.example3.set3.data.map((i: number) => (i / 10) + 6));
Stat.showData();
let newMode = Stat.mode();
console.log(`ฐานนิยม ข้อมูลเดิม ${mode}\nฐานนิยม ข้อมูลใหม่ ${newMode}`);
/*
    ข้อมูลเดิมคือ 10 , 30 , 20 , 10 , 40 , 30 , 10 , 20 , 10 , 30
    เรียงข้อมูลชุดใหม่ได้ 10 , 10 , 10 , 10 , 20 , 20 , 30 , 30 , 30 , 40
    ข้อมูลเดิมคือ 7 , 9 , 8 , 7 , 10 , 9 , 7 , 8 , 7 , 9
    เรียงข้อมูลชุดใหม่ได้ 7 , 7 , 7 , 7 , 8 , 8 , 9 , 9 , 9 , 10
    ฐานนิยม ข้อมูลเดิม ฐานนิยม Mo = 10
    ฐานนิยม ข้อมูลใหม่ ฐานนิยม Mo = 7
*/

Stat = new Statistics([], d.example3.set4.frequency, d.example3.set4.classInterval);
Stat.showTable('t3');
console.log(Stat.mode());
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │   '5 - 9'   │      7       │    5     │      5      │       35       │
    │    2    │  '10 - 14'  │      12      │    6     │     11      │       72       │
    │    3    │  '15 - 19'  │      17      │    7     │     18      │      119       │
    │    4    │  '20 - 24'  │      22      │    10    │     28      │      220       │
    │    5    │  '25 - 29'  │      27      │    1     │     29      │       27       │
    │    6    │  '30 - 34'  │      32      │    1     │     30      │       32       │
    │    7    │    'รวม'    │  'Σx = 117'  │ 'n = 30' │    ' - '    │  'Σxf = 505'   │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
        สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 30 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 16.833333333333332 ≈ 16.83
    ฐานนิยม Mo = 20.75
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 20.75
*/

Stat = new Statistics([], d.example3.set5.frequency, d.example3.set5.classInterval);
Stat.showTable('t3');
console.log(Stat.mode());
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │  '20 - 29'  │     24.5     │    8     │      8      │      196       │
    │    2    │  '30 - 39'  │     34.5     │    3     │     11      │     103.5      │
    │    3    │  '40 - 49'  │     44.5     │    6     │     17      │      267       │
    │    4    │  '50 - 59'  │     54.5     │    10    │     27      │      545       │
    │    5    │  '60 - 69'  │     64.5     │    2     │     29      │      129       │
    │    6    │  '70 - 79'  │     74.5     │    4     │     33      │      298       │
    │    7    │    'รวม'    │  'Σx = 297'  │ 'n = 33' │    ' - '    │ 'Σxf = 1538.5' │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
        สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 33 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 46.621212121212125 ≈ 46.62
    ฐานนิยม Mo = 52.833333333333336
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 52.83
*/

Stat = new Statistics([], d.example3.set6.frequency, d.example3.set6.classInterval);
Stat.showTable('t3', '', '', 'คะแนน');
console.log(Stat.mode());
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │   'คะแนน'   │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │ '100 - 139' │    119.5     │    10    │     10      │      1195      │
    │    2    │ '140 - 179' │    159.5     │    6     │     16      │      957       │
    │    3    │ '180 - 219' │    199.5     │    15    │     31      │     2992.5     │
    │    4    │ '220 - 259' │    239.5     │    12    │     43      │      2874      │
    │    5    │ '260 - 299' │    279.5     │    4     │     47      │      1118      │
    │    6    │    'รวม'    │ 'Σx = 997.5' │ 'n = 47' │    ' - '    │ 'Σxf = 9136.5' │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
        สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 47 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 194.39361702127658 ≈ 194.39
    ฐานนิยม Mo = 209.5
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 209.50
*/

Stat = new Statistics(d.example4.set1.data);
Stat.showData();
console.log(Stat.geometricMean());
/*
    ข้อมูลเดิมคือ 2 , 4 , 8
    เรียงข้อมูลชุดใหม่ได้ 2 , 4 , 8
    ค่าเฉลี่ยเรขาคณิต G.M. = 3.9999999999999996
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 4.00
*/

Stat = new Statistics(d.example4.set2.data);
Stat.showData();
console.log(Stat.geometricMean());
/*
    ข้อมูลเดิมคือ 4 , 8 , 9 , 16 , 18 , 27 , 16
    เรียงข้อมูลชุดใหม่ได้ 4 , 8 , 9 , 16 , 16 , 18 , 27
    ค่าเฉลี่ยเรขาคณิต G.M. = 11.999999999999998
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 12.00
*/

Stat = new Statistics(d.example4.set3.data);
Stat.showData();
console.log(Stat.harmonicMean());
/*
    ข้อมูลเดิมคือ 10 , 15 , 8 , 6
    เรียงข้อมูลชุดใหม่ได้ 6 , 8 , 10 , 15
    ค่าเฉลี่ยฮาร์โมนิค H.M. = 8.727272727272727
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 8.73
*/

Stat = new Statistics(d.example4.set4.data);
Stat.showData();
console.log(Stat.harmonicMean());
/*
    ข้อมูลเดิมคือ 2 , 3 , 4 , 6 , 4 , 3
    เรียงข้อมูลชุดใหม่ได้ 2 , 3 , 3 , 4 , 4 , 6
    ค่าเฉลี่ยฮาร์โมนิค H.M. = 3.272727272727273
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 3.27
*/

Stat = new Statistics([], d.example4.set5.frequency, d.example4.set5.classInterval);
console.log(Stat.harmonicMean());
// ค่าเฉลี่ยฮาร์โมนิค H.M. = 17.791735537190082
// ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 17.79

Stat = new Statistics(d.example4.set6.data);
Stat.showData();
console.log(Stat.midRange());
/*
    ข้อมูลเดิมคือ 2 , 7 , 9 , 15 , 22 , 30 , 17
    เรียงข้อมูลชุดใหม่ได้ 2 , 7 , 9 , 15 , 17 , 22 , 30
    ค่ากึ่งกลางพิสัย = 16
*/

Stat = new Statistics(d.example4.set7.data);
Stat.showData();
console.log(Stat.midRange());
/*
    ข้อมูลเดิมคือ 65 , 71 , 32 , 69 , 78 , 81 , 45
    เรียงข้อมูลชุดใหม่ได้ 32 , 45 , 65 , 69 , 71 , 78 , 81
    ค่ากึ่งกลางพิสัย = 56.5
*/

Stat = new Statistics(d.example4.set8.data);
Stat.showData();
console.log(Stat.harmonicMean());
/*
    ข้อมูลเดิมคือ 80 , 100
    เรียงข้อมูลชุดใหม่ได้ 80 , 100
    ค่าเฉลี่ยฮาร์โมนิค H.M. = 88.88888888888889
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 88.89
*/

Stat = new Statistics(d.example4.set9.data, d.example4.set9.frequency);
Stat.showData();
Stat.showFrequency();
console.log(Stat.harmonicMean());
/*
    ข้อมูลเดิมคือ 1000 , 1500 , 2000
    เรียงข้อมูลชุดใหม่ได้ 1000 , 1500 , 2000
    ความถี่ 400 , 500 , 400
    ความถี่สะสม 400 , 900 , 1300
    ค่าเฉลี่ยฮาร์โมนิค H.M. = 428.57142857142856
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 428.57
*/

Stat = new Statistics(d.example5.set1.data);
Stat.showData();
console.log(Stat.Qr(3));
console.log(Stat.Dr(2));
console.log(Stat.Pr(85));
/*
    ข้อมูลเดิมคือ 35 , 31 , 42 , 43 , 30 , 35 , 49 , 48 , 25 , 60 , 52
    เรียงข้อมูลชุดใหม่ได้ 25 , 30 , 31 , 35 , 35 , 42 , 43 , 48 , 49 , 52 , 60
    ตำแหน่งควอร์ไทล์ Q3 = 9
    ค่าของควอร์ไทล์ Q3 = 49
    ตำแหน่งเดไซล์ D2 = 2.4
    ค่าของเดไซล์ D2 = 30.4
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 30.40
    ตำแหน่งเปอร์เซนต์ไทล์ P85 = 10.2
    ค่าของเปอร์เซนต์ไทล์ P85 = 53.6
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 53.60
*/

Stat = new Statistics(d.example5.set2.data, d.example5.set2.frequency);
Stat.showTable('t2')
console.log(Stat.Qr(2));
console.log(Stat.Dr(4));
console.log(Stat.Pr(67));
/*
    ┌─────────┬───────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     x     │    f     │     cf      │       xf       │
    ├─────────┼───────────┼──────────┼─────────────┼────────────────┤
    │    0    │  'ข้อมูล'   │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │     5     │    1     │      1      │       5        │
    │    2    │     7     │    3     │      4      │       21       │
    │    3    │    10     │    5     │      9      │       50       │
    │    4    │    14     │    4     │     13      │       56       │
    │    5    │    15     │    2     │     15      │       30       │
    │    6    │ 'Σx = 51' │ 'n = 15' │    ' - '    │  'Σxf = 162'   │
    └─────────┴───────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 15 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 10.8 ≈ 10.80
    ตำแหน่งควอร์ไทล์ Q2 = 8
    ค่าของควอร์ไทล์ Q2 = 10
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 10.00
    ตำแหน่งเดไซล์ D4 = 6.4
    ค่าของเดไซล์ D4 = 10
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 10.00
    ตำแหน่งเปอร์เซนต์ไทล์ P67 = 10.72
    ค่าของเปอร์เซนต์ไทล์ P67 = 14
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 14.00
*/

Stat = new Statistics(d.example5.set3.data);
Stat.showData();
console.log(Stat.Qr(3));
console.log(Stat.Dr(2));
console.log(Stat.Pr(65));
/*
    ข้อมูลเดิมคือ 10 , 5 , 4 , 9 , 12 , 15 , 7 , 18
    เรียงข้อมูลชุดใหม่ได้ 4 , 5 , 7 , 9 , 10 , 12 , 15 , 18
    ตำแหน่งควอร์ไทล์ Q3 = 6.75
    ค่าของควอร์ไทล์ Q3 = 14.25
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 14.25
    ตำแหน่งเดไซล์ D2 = 1.8
    ค่าของเดไซล์ D2 = 4.8
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 4.80
    ตำแหน่งเปอร์เซนต์ไทล์ P65 = 5.85
    ค่าของเปอร์เซนต์ไทล์ P65 = 11.7
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 11.70
*/

Stat = new Statistics(d.example5.set4.data);
Stat.showData();
console.log(Stat.Qr(1));
console.log(Stat.Dr(8));
console.log(Stat.Pr(40));
/*
    ข้อมูลเดิมคือ 176 , 164 , 168 , 161 , 165 , 182 , 177 , 170 , 169 , 178 , 172 , 164 , 154 , 177 , 142
    เรียงข้อมูลชุดใหม่ได้ 142 , 154 , 161 , 164 , 164 , 165 , 168 , 169 , 170 , 172 , 176 , 177 , 177 , 178 , 182
    ตำแหน่งควอร์ไทล์ Q1 = 4
    ค่าของควอร์ไทล์ Q1 = 164
    ตำแหน่งเดไซล์ D8 = 12.8
    ค่าของเดไซล์ D8 = 177
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 177.00
    ตำแหน่งเปอร์เซนต์ไทล์ P40 = 6.4
    ค่าของเปอร์เซนต์ไทล์ P40 = 166.2
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 166.20
*/

Stat = new Statistics(d.example5.set5.data, d.example5.set5.frequency);
Stat.showTable('t2', 'น้ำหนัก', 'จำนวน');
console.log(Stat.Qr(2));
console.log(Stat.Dr(3));
console.log(Stat.Pr(74));
/*
    ┌─────────┬────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     x      │    f     │     cf      │       xf       │
    ├─────────┼────────────┼──────────┼─────────────┼────────────────┤
    │    0    │  'น้ำหนัก'   │ 'จำนวน'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │     40     │    4     │      4      │      160       │
    │    2    │     42     │    6     │     10      │      252       │
    │    3    │     45     │    10    │     20      │      450       │
    │    4    │     46     │    9     │     29      │      414       │
    │    5    │     48     │    9     │     38      │      432       │
    │    6    │     50     │    5     │     43      │      250       │
    │    7    │     54     │    5     │     48      │      270       │
    │    8    │     56     │    3     │     51      │      168       │
    │    9    │ 'Σx = 381' │ 'n = 51' │    ' - '    │  'Σxf = 2396'  │
    └─────────┴────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 51 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 46.98039215686274 ≈ 46.98
    ตำแหน่งควอร์ไทล์ Q2 = 26
    ค่าของควอร์ไทล์ Q2 = 46
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 46.00
    ตำแหน่งเดไซล์ D3 = 15.6
    ค่าของเดไซล์ D3 = 45
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 45.00
    ตำแหน่งเปอร์เซนต์ไทล์ P74 = 38.48
    ค่าของเปอร์เซนต์ไทล์ P74 = 50
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 50.00
*/

Stat = new Statistics(d.example5.set6.data, d.example5.set6.frequency);
Stat.showTable('t2', 'คะแนน');
console.log(Stat.Qr(1));
console.log(Stat.Dr(6));
console.log(Stat.Pr(84));
/*
    ┌─────────┬─────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │      x      │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────┼─────────────┼────────────────┤
    │    0    │   'คะแนน'   │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │     140     │    1     │      1      │      140       │
    │    2    │     144     │    3     │      4      │      432       │
    │    3    │     149     │    8     │     12      │      1192      │
    │    4    │     154     │    12    │     24      │      1848      │
    │    5    │     158     │    10    │     34      │      1580      │
    │    6    │     162     │    10    │     44      │      1620      │
    │    7    │     168     │    9     │     53      │      1512      │
    │    8    │     172     │    6     │     59      │      1032      │
    │    9    │     178     │    1     │     60      │      178       │
    │   10    │ 'Σx = 1425' │ 'n = 60' │    ' - '    │  'Σxf = 9534'  │
    └─────────┴─────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 60 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 158.9 ≈ 158.90
    ตำแหน่งควอร์ไทล์ Q1 = 15.25
    ค่าของควอร์ไทล์ Q1 = 154
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 154.00
    ตำแหน่งเดไซล์ D6 = 36.6
    ค่าของเดไซล์ D6 = 162
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 162.00
    ตำแหน่งเปอร์เซนต์ไทล์ P84 = 51.24
    ค่าของเปอร์เซนต์ไทล์ P84 = 168
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 168.00
*/

Stat = new Statistics([], d.example5.set7.frequency, d.example5.set7.classInterval);
Stat.showTable('t3');
console.log(Stat.Qr(3));
console.log(Stat.Dr(4));
console.log(Stat.Pr(72));
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │  '21 - 30'  │     25.5     │    5     │      5      │     127.5      │
    │    2    │  '31 - 40'  │     35.5     │    9     │     14      │     319.5      │
    │    3    │  '41 - 50'  │     45.5     │    12    │     26      │      546       │
    │    4    │  '51 - 60'  │     55.5     │    8     │     34      │      444       │
    │    5    │  '61 - 70'  │     65.5     │    11    │     45      │     720.5      │
    │    6    │  '71 - 80'  │     75.5     │    15    │     60      │     1132.5     │
    │    7    │    'รวม'    │  'Σx = 303'  │ 'n = 60' │    ' - '    │  'Σxf = 3290'  │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 60 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 54.833333333333336 ≈ 54.83
    ตำแหน่งควอร์ไทล์ Q3 = 45
    ค่าของควอร์ไทล์ Q3 = 70.5
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 70.50
    ตำแหน่งเดไซล์ D4 = 24
    ค่าของเดไซล์ D4 = 48.833333333333336
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 48.83
    ตำแหน่งเปอร์เซนต์ไทล์ P72 = 43.2
    ค่าของเปอร์เซนต์ไทล์ P72 = 68.86363636363637
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 68.86
*/

Stat = new Statistics([], d.example5.set8.frequency, d.example5.set8.classInterval);
Stat.showTable('t3');
console.log(Stat.Qr(1));
console.log(Stat.Pr(83));
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │  '11 - 20'  │     15.5     │    1     │      1      │      15.5      │
    │    2    │  '21 - 30'  │     25.5     │    2     │      3      │       51       │
    │    3    │  '31 - 40'  │     35.5     │    4     │      7      │      142       │
    │    4    │  '41 - 50'  │     45.5     │    12    │     19      │      546       │
    │    5    │  '51 - 60'  │     55.5     │    10    │     29      │      555       │
    │    6    │  '61 - 70'  │     65.5     │    10    │     39      │      655       │
    │    7    │  '71 - 80'  │     75.5     │    5     │     44      │     377.5      │
    │    8    │  '81 - 90'  │     85.5     │    6     │     50      │      513       │
    │    9    │    'รวม'    │  'Σx = 404'  │ 'n = 50' │    ' - '    │  'Σxf = 2855'  │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 50 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 57.1 ≈ 57.10
    ตำแหน่งควอร์ไทล์ Q1 = 12.5
    ค่าของควอร์ไทล์ Q1 = 45.083333333333336
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 45.08
    ตำแหน่งเปอร์เซนต์ไทล์ P83 = 41.5
    ค่าของเปอร์เซนต์ไทล์ P83 = 75.5
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 75.50
*/

Stat = new Statistics([], d.example6.set1.frequency, d.example6.set1.classInterval);
Stat.showTable('t3');
console.log(Stat.Qr(2));
console.log(Stat.Dr(3));
console.log(Stat.Pr(81));
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │   '2 - 5'   │     3.5      │    6     │      6      │       21       │
    │    2    │   '6 - 9'   │     7.5      │    10    │     16      │       75       │
    │    3    │  '10 - 13'  │     11.5     │    14    │     30      │      161       │
    │    4    │  '14 - 17'  │     15.5     │    8     │     38      │      124       │
    │    5    │  '18 - 21'  │     19.5     │    2     │     40      │       39       │
    │    6    │    'รวม'    │ 'Σx = 57.5'  │ 'n = 40' │    ' - '    │  'Σxf = 420'   │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 40 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 10.5 ≈ 10.50
    ตำแหน่งควอร์ไทล์ Q2 = 20
    ค่าของควอร์ไทล์ Q2 = 10.642857142857142
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 10.64
    ตำแหน่งเดไซล์ D3 = 12
    ค่าของเดไซล์ D3 = 7.9
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 7.90
    ตำแหน่งเปอร์เซนต์ไทล์ P81 = 32.4
    ค่าของเปอร์เซนต์ไทล์ P81 = 14.7
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 14.70
*/

Stat = new Statistics([], d.example6.set3.frequency1, d.example6.set3.classInterval);
Stat.showTable('t3');
console.log(Stat.Pr(65));
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │  '30 - 39'  │     34.5     │    2     │      2      │       69       │
    │    2    │  '40 - 49'  │     44.5     │    5     │      7      │     222.5      │
    │    3    │  '50 - 59'  │     54.5     │    11    │     18      │     599.5      │
    │    4    │  '60 - 69'  │     64.5     │    15    │     33      │     967.5      │
    │    5    │  '70 - 79'  │     74.5     │    8     │     41      │      596       │
    │    6    │  '80 - 89'  │     84.5     │    6     │     47      │      507       │
    │    7    │  '90 - 99'  │     94.5     │    3     │     50      │     283.5      │
    │    8    │    'รวม'    │ 'Σx = 451.5' │ 'n = 50' │    ' - '    │  'Σxf = 3245'  │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 50 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 64.9 ≈ 64.90
    ตำแหน่งเปอร์เซนต์ไทล์ P65 = 32.5
    ค่าของเปอร์เซนต์ไทล์ P65 = 69.16666666666667
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 69.17
*/

Stat = new Statistics([], d.example6.set3.frequency2, d.example6.set3.classInterval);
Stat.showTable('t3');
console.log(Stat.Qr(1));
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │  '30 - 39'  │     34.5     │    3     │      3      │     103.5      │
    │    2    │  '40 - 49'  │     44.5     │    4     │      7      │      178       │
    │    3    │  '50 - 59'  │     54.5     │    13    │     20      │     708.5      │
    │    4    │  '60 - 69'  │     64.5     │    12    │     32      │      774       │
    │    5    │  '70 - 79'  │     74.5     │    10    │     42      │      745       │
    │    6    │  '80 - 89'  │     84.5     │    5     │     47      │     422.5      │
    │    7    │  '90 - 99'  │     94.5     │    3     │     50      │     283.5      │
    │    8    │    'รวม'    │ 'Σx = 451.5' │ 'n = 50' │    ' - '    │  'Σxf = 3215'  │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 50 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 64.3 ≈ 64.30
    ตำแหน่งควอร์ไทล์ Q1 = 12.5
    ค่าของควอร์ไทล์ Q1 = 53.73076923076923
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 53.73
*/

Stat = new Statistics(d.example6.set4.data1);
Stat.showData()
console.log(Stat.range());
/*
    ข้อมูลเดิมคือ 2 , 7 , 5 , 4 , 9
    เรียงข้อมูลชุดใหม่ได้ 2 , 4 , 5 , 7 , 9
    พิสัย = 7
*/
Stat = new Statistics(d.example6.set4.data2);
Stat.showData()
console.log(Stat.range());
/*
    ข้อมูลเดิมคือ 9 , 11 , 15 , 16 , 10 , 19 , 8 , 21
    เรียงข้อมูลชุดใหม่ได้ 8 , 9 , 10 , 11 , 15 , 16 , 19 , 21
    พิสัย = 13
*/
Stat = new Statistics(d.example6.set4.data3);
Stat.showData()
console.log(Stat.range());
/*
    ข้อมูลเดิมคือ 20 , 35 , 38 , 10 , 16 , 7 , 76
    เรียงข้อมูลชุดใหม่ได้ 7 , 10 , 16 , 20 , 35 , 38 , 76
    พิสัย = 69
*/
Stat = new Statistics(d.example6.set4.data4);
Stat.showData()
console.log(Stat.range());
/*
    ข้อมูลเดิมคือ 23 , 45 , 12 , 95 , 63 , 56 , 78 , 10
    เรียงข้อมูลชุดใหม่ได้ 10 , 12 , 23 , 45 , 56 , 63 , 78 , 95
    พิสัย = 85
*/

Stat = new Statistics([], d.example6.set5.frequency, d.example6.set5.classInterval);
Stat.showTable('t3')
console.log(Stat.range());
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │  '21 - 30'  │     25.5     │    2     │      2      │       51       │
    │    2    │  '31 - 40'  │     35.5     │    6     │      8      │      213       │
    │    3    │  '41 - 50'  │     45.5     │    9     │     17      │     409.5      │
    │    4    │  '51 - 60'  │     55.5     │    3     │     20      │     166.5      │
    │    5    │    'รวม'    │  'Σx = 162'  │ 'n = 20' │    ' - '    │  'Σxf = 840'   │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 20 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 42 ≈ 42.00
    พิสัย = 40
*/

Stat = new Statistics([], d.example6.set7.frequency, d.example6.set7.classInterval);
Stat.showTable('t3', '', 'จำนวน', 'น้ำหนัก')
console.log(Stat.range());
/*
    ┌─────────┬───────────┬──────────────┬───────────┬─────────────┬────────────────┐
    │ (index) │    ci     │      x       │     f     │     cf      │       xf       │
    ├─────────┼───────────┼──────────────┼───────────┼─────────────┼────────────────┤
    │    0    │  'น้ำหนัก'  │ 'จุดกึ่งกลางชั้น' │  'จำนวน'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │ '72 - 74' │      73      │     8     │      8      │      584       │
    │    2    │ '69 - 71' │      70      │    27     │     35      │      1890      │
    │    3    │ '66 - 68' │      67      │    42     │     77      │      2814      │
    │    4    │ '63 - 65' │      64      │    18     │     95      │      1152      │
    │    5    │ '60 - 62' │      61      │     5     │     100     │      305       │
    │    6    │   'รวม'   │  'Σx = 335'  │ 'n = 100' │    ' - '    │  'Σxf = 6745'  │
    └─────────┴───────────┴──────────────┴───────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 100 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 67.45 ≈ 67.45
    พิสัย = 15
*/

Stat = new Statistics(d.example6.set8.data);
Stat.showData();
console.log(Stat.Qr(1));
console.log(Stat.Qr(3));
console.log(Stat.quartileDeviation());
/*
    ข้อมูลเดิมคือ 10 , 12 , 17 , 25 , 28 , 32 , 36 , 42 , 50 , 54
    เรียงข้อมูลชุดใหม่ได้ 10 , 12 , 17 , 25 , 28 , 32 , 36 , 42 , 50 , 54
    ตำแหน่งควอร์ไทล์ Q1 = 2.75
    ค่าของควอร์ไทล์ Q1 = 15.75
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 15.75
    ตำแหน่งควอร์ไทล์ Q3 = 8.25
    ค่าของควอร์ไทล์ Q3 = 44
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 44.00
    ส่วนเบี่ยงเบนควอร์ไทล์ Q.D. = 14.125
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 14.13
*/

Stat = new Statistics(d.example6.set9.data, d.example6.set9.frequency);
Stat.showTable('t2');
console.log(Stat.Qr(1));
console.log(Stat.Qr(3));
console.log(Stat.quartileDeviation());
/*
    ┌─────────┬───────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     x     │    f     │     cf      │       xf       │
    ├─────────┼───────────┼──────────┼─────────────┼────────────────┤
    │    0    │  'ข้อมูล'   │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │    10     │    8     │      8      │       80       │
    │    2    │    13     │    5     │     13      │       65       │
    │    3    │    15     │    4     │     17      │       60       │
    │    4    │    20     │    12    │     29      │      240       │
    │    5    │    24     │    3     │     32      │       72       │
    │    6    │ 'Σx = 82' │ 'n = 32' │    ' - '    │  'Σxf = 517'   │
    └─────────┴───────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 32 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 16.15625 ≈ 16.16
    ตำแหน่งควอร์ไทล์ Q1 = 8.25
    ค่าของควอร์ไทล์ Q1 = 13
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 13.00
    ตำแหน่งควอร์ไทล์ Q3 = 24.75
    ค่าของควอร์ไทล์ Q3 = 20
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 20.00
    ส่วนเบี่ยงเบนควอร์ไทล์ Q.D. = 4.625
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 4.63
*/

Stat = new Statistics([], d.example6.set10.frequency, d.example6.set10.classInterval);
Stat.showTable('t3');
console.log(Stat.Qr(1));
console.log(Stat.Qr(3));
console.log(Stat.quartileDeviation());
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │  '40 - 44'  │      42      │    2     │      2      │       84       │
    │    2    │  '45 - 49'  │      47      │    6     │      8      │      282       │
    │    3    │  '50 - 54'  │      52      │    10    │     18      │      520       │
    │    4    │  '55 - 59'  │      57      │    15    │     33      │      855       │
    │    5    │  '60 - 64'  │      62      │    12    │     45      │      744       │
    │    6    │  '65 - 69'  │      67      │    6     │     51      │      402       │
    │    7    │  '70 - 74'  │      72      │    3     │     54      │      216       │
    │    8    │    'รวม'    │  'Σx = 399'  │ 'n = 54' │    ' - '    │  'Σxf = 3103'  │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 54 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 57.46296296296296 ≈ 57.46
    ตำแหน่งควอร์ไทล์ Q1 = 13.5
    ค่าของควอร์ไทล์ Q1 = 52.25
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 52.25
    ตำแหน่งควอร์ไทล์ Q3 = 40.5
    ค่าของควอร์ไทล์ Q3 = 62.625
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 62.63
    49.5 59.5 8 33
    ส่วนเบี่ยงเบนควอร์ไทล์ Q.D. = 5.190000000000001
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 5.19
*/

Stat = new Statistics(d.example7.set1.data);
Stat.showData()
console.log(Stat.range());
console.log(Stat.quartileDeviation());
/*
    ข้อมูลเดิมคือ 71 , 69 , 88 , 55 , 61 , 71 , 42 , 59 , 63 , 68 , 70 , 76 , 58 , 63 , 70 , 71 , 71 , 82 , 50 , 63
    เรียงข้อมูลชุดใหม่ได้ 42 , 50 , 55 , 58 , 59 , 61 , 63 , 63 , 63 , 68 , 69 , 70 , 70 , 71 , 71 , 71 , 71 , 76 , 82 , 88
    พิสัย = 46
    ส่วนเบี่ยงเบนควอร์ไทล์ Q.D. = 5.75
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 5.75
*/

Stat = new Statistics(d.example7.set2.data, d.example7.set2.frequency);
Stat.showTable('t1')
console.log(Stat.range());
console.log(Stat.quartileDeviation());
/*
    ┌─────────┬─────────────┬───────────┬────────────────┐
    │ (index) │      x      │     f     │       xf       │
    ├─────────┼─────────────┼───────────┼────────────────┤
    │    0    │   'ข้อมูล'    │  'ความถี่'  │ 'ข้อมูล x ความถี่' │
    │    1    │     150     │     8     │      1200      │
    │    2    │     152     │    12     │      1824      │
    │    3    │     155     │    15     │      2325      │
    │    4    │     156     │    18     │      2808      │
    │    5    │     158     │    10     │      1580      │
    │    6    │     160     │    11     │      1760      │
    │    7    │     163     │     9     │      1467      │
    │    8    │     165     │     9     │      1485      │
    │    9    │     170     │     8     │      1360      │
    │   10    │ 'Σx = 1429' │ 'n = 100' │ 'Σxf = 15809'  │
    └─────────┴─────────────┴───────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 100 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 158.09 ≈ 158.09
    พิสัย = 21
    ส่วนเบี่ยงเบนควอร์ไทล์ Q.D. = 4
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 4.00
*/

Stat = new Statistics([], d.example7.set3.frequency, d.example7.set3.classInterval);
Stat.showTable('t3')
console.log(Stat.range());
console.log(Stat.quartileDeviation());
/*
    ┌─────────┬─────────────┬──────────────┬──────────┬─────────────┬────────────────┐
    │ (index) │     ci      │      x       │    f     │     cf      │       xf       │
    ├─────────┼─────────────┼──────────────┼──────────┼─────────────┼────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │ 'ความถี่'  │ 'ความถี่สะสม' │ 'ข้อมูล x ความถี่' │
    │    1    │  '10 - 14'  │      12      │    3     │      3      │       36       │
    │    2    │  '15 - 19'  │      17      │    7     │     10      │      119       │
    │    3    │  '20 - 24'  │      22      │    16    │     26      │      352       │
    │    4    │  '25 - 29'  │      27      │    12    │     38      │      324       │
    │    5    │  '30 - 34'  │      32      │    2     │     40      │       64       │
    │    6    │    'รวม'    │  'Σx = 110'  │ 'n = 40' │    ' - '    │  'Σxf = 895'   │
    └─────────┴─────────────┴──────────────┴──────────┴─────────────┴────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 40 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 22.375 ≈ 22.38
    พิสัย = 25
    ส่วนเบี่ยงเบนควอร์ไทล์ Q.D. = 3.335000000000001
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 3.34
*/

Stat = new Statistics(d.example7.set4.data);
Stat.showTable('t5')
console.log(Stat.meanDeviation());
/*
    ┌─────────┬────────────┬────────────────────┐
    │ (index) │     x      │      |x - x̄|       │
    ├─────────┼────────────┼────────────────────┤
    │    0    │   'ข้อมูล'   │ '|ข้อมูล - ค่าเฉลี่ย|'  │
    │    1    │     12     │ 9.600000000000001  │
    │    2    │     15     │ 6.600000000000001  │
    │    3    │     35     │ 13.399999999999999 │
    │    4    │     27     │ 5.399999999999999  │
    │    5    │     19     │ 2.6000000000000014 │
    │    6    │ 'Σx = 108' │ 'Σ|x - x̄| = 37.6'  │
    └─────────┴────────────┴────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 5 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 21.6 ≈ 21.60
    - ส่วนเบี่ยงเบนเฉลี่ย = 7.5200000000000005 ≈ 7.52
    ส่วนเบี่ยงเบนเฉลี่ย M.D. = 7.5200000000000005
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 7.52
*/

Stat = new Statistics(d.example7.set5.data, d.example7.set5.frequency,);
Stat.showTable('t5', 'อายุ', 'จำนวน');
console.log(Stat.meanDeviation());
/*
    ┌─────────┬───────────┬──────────┬───────────────┬──────────────────┬──────────────────────────┐
    │ (index) │     x     │    f     │      xf       │     |x - x̄|      │         f|x - x̄|         │
    ├─────────┼───────────┼──────────┼───────────────┼──────────────────┼──────────────────────────┤
    │    0    │   'อายุ'   │ 'จำนวน'  │ 'อายุ x จำนวน' │ '|อายุ - ค่าเฉลี่ย|' │ 'จำนวน x |อายุ - ค่าเฉลี่ย|' │
    │    1    │    10     │    7     │      70       │        5         │            35            │
    │    2    │    13     │    5     │      65       │        2         │            10            │
    │    3    │    15     │    12    │      180      │        0         │            0             │
    │    4    │    17     │    10    │      170      │        2         │            20            │
    │    5    │    19     │    5     │      95       │        4         │            20            │
    │    6    │    20     │    1     │      20       │        5         │            5             │
    │    7    │ 'Σx = 94' │ 'n = 40' │  'Σxf = 600'  │ 'Σ|x - x̄| = 18'  │     'Σf|x - x̄| = 90'     │
    └─────────┴───────────┴──────────┴───────────────┴──────────────────┴──────────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 40 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 15 ≈ 15.00
    - ส่วนเบี่ยงเบนเฉลี่ย = 2.25 ≈ 2.25
    ส่วนเบี่ยงเบนเฉลี่ย M.D. = 2.25
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 2.25
*/

Stat = new Statistics([], d.example7.set6.frequency, d.example7.set6.classInterval);
Stat.showTable('t5', '', 'จำนวน', 'คะแนน');
console.log(Stat.meanDeviation());
/*
    ┌─────────┬───────────┬────────────┬──────────┬─────────────────┬────────────────────┬────────────────────────────┐
    │ (index) │    ci     │     x      │    f     │       xf        │      |x - x̄|       │          f|x - x̄|          │
    ├─────────┼───────────┼────────────┼──────────┼─────────────────┼────────────────────┼────────────────────────────┤
    │    0    │  'คะแนน'  │  'คะแนน'   │ 'จำนวน'  │ 'คะแนน x จำนวน' │ '|คะแนน - ค่าเฉลี่ย|' │ 'จำนวน x |คะแนน - ค่าเฉลี่ย|' │
    │    1    │ '10 - 14' │     12     │    3     │       36        │ 12.333333333333332 │             37             │
    │    2    │ '15 - 19' │     17     │    5     │       85        │ 7.333333333333332  │     36.66666666666666      │
    │    3    │ '20 - 24' │     22     │    7     │       154       │ 2.333333333333332  │     16.333333333333325     │
    │    4    │ '25 - 29' │     27     │    8     │       216       │ 2.666666666666668  │     21.333333333333343     │
    │    5    │ '30 - 34' │     32     │    4     │       128       │ 7.666666666666668  │     30.66666666666667      │
    │    6    │ '35 - 39' │     37     │    3     │       111       │ 12.666666666666668 │             38             │
    │    7    │   'รวม'   │ 'Σx = 147' │ 'n = 30' │   'Σxf = 730'   │  'Σ|x - x̄| = 45'   │     'Σf|x - x̄| = 180'      │
    └─────────┴───────────┴────────────┴──────────┴─────────────────┴────────────────────┴────────────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 30 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 24.333333333333332 ≈ 24.33
    - ส่วนเบี่ยงเบนเฉลี่ย = 6 ≈ 6.00
    ส่วนเบี่ยงเบนเฉลี่ย M.D. = 6
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 6.00
*/

Stat = new Statistics(d.example8.set1.data);
Stat.showData();
console.log(Stat.meanDeviation());
/*
    ข้อมูลเดิมคือ 16 , 11 , 10 , 14 , 19
    เรียงข้อมูลชุดใหม่ได้ 10 , 11 , 14 , 16 , 19
    ส่วนเบี่ยงเบนเฉลี่ย M.D. = 2.8
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 2.80
*/

Stat = new Statistics(d.example8.set2.data, d.example8.set2.frequency);
Stat.showTable('t5', 'น้ำหนัก', 'จำนวน');
console.log(Stat.meanDeviation());
/*
    ┌─────────┬────────────┬───────────┬─────────────────┬─────────────────────────────────┬──────────────────────────────────┐
    │ (index) │     x      │     f     │       xf        │             |x - x̄|             │             f|x - x̄|             │
    ├─────────┼────────────┼───────────┼─────────────────┼─────────────────────────────────┼──────────────────────────────────┤
    │    0    │  'น้ำหนัก'   │  'จำนวน'  │ 'น้ำหนัก x จำนวน' │       '|น้ำหนัก - ค่าเฉลี่ย|'        │    'จำนวน x |น้ำหนัก - ค่าเฉลี่ย|'    │
    │    1    │     40     │    15     │       600       │        6.299999999999997        │        94.49999999999996         │
    │    2    │     42     │    25     │      1050       │        4.299999999999997        │        107.49999999999993        │
    │    3    │     45     │    20     │       900       │       1.2999999999999972        │        25.999999999999943        │
    │    4    │     50     │    24     │      1200       │        3.700000000000003        │        88.80000000000007         │
    │    5    │     55     │    16     │       880       │        8.700000000000003        │        139.20000000000005        │
    │    6    │ 'Σx = 232' │ 'n = 100' │  'Σxf = 4630'   │ 'Σ|x - x̄| = 24.299999999999997' │ 'Σf|x - x̄| = 455.99999999999994' │
    └─────────┴────────────┴───────────┴─────────────────┴─────────────────────────────────┴──────────────────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 100 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 46.3 ≈ 46.30
    - ส่วนเบี่ยงเบนเฉลี่ย = 4.56 ≈ 4.56
    ส่วนเบี่ยงเบนเฉลี่ย M.D. = 4.56
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 4.56
*/

Stat = new Statistics([], d.example8.set3.frequency, d.example8.set3.classInterval);
Stat.showTable('t5', '', 'จำนวน', 'คะแนน');
console.log(Stat.meanDeviation());
/*
    ┌─────────┬───────────┬────────────┬───────────┬─────────────────┬─────────────────────────────────┬──────────────────────────────────┐
    │ (index) │    ci     │     x      │     f     │       xf        │             |x - x̄|             │             f|x - x̄|             │
    ├─────────┼───────────┼────────────┼───────────┼─────────────────┼─────────────────────────────────┼──────────────────────────────────┤
    │    0    │  'คะแนน'  │  'คะแนน'   │  'จำนวน'  │ 'คะแนน x จำนวน' │       '|คะแนน - ค่าเฉลี่ย|'        │    'จำนวน x |คะแนน - ค่าเฉลี่ย|'    │
    │    1    │ '60 - 62' │     61     │    10     │       610       │        5.849999999999994        │        58.49999999999994         │
    │    2    │ '63 - 65' │     64     │    18     │      1152       │       2.8499999999999943        │         51.2999999999999         │
    │    3    │ '66 - 68' │     67     │    42     │      2814       │       0.15000000000000568       │        6.300000000000239         │
    │    4    │ '69 - 71' │     70     │    27     │      1890       │       3.1500000000000057        │        85.05000000000015         │
    │    5    │ '72 - 74' │     73     │     3     │       219       │        6.150000000000006        │        18.450000000000017        │
    │    6    │   'รวม'   │ 'Σx = 335' │ 'n = 100' │  'Σxf = 6685'   │ 'Σ|x - x̄| = 18.150000000000006' │ 'Σf|x - x̄| = 219.60000000000025' │
    └─────────┴───────────┴────────────┴───────────┴─────────────────┴─────────────────────────────────┴──────────────────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 100 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 66.85 ≈ 66.85
    - ส่วนเบี่ยงเบนเฉลี่ย = 2.1960000000000024 ≈ 2.20
    ส่วนเบี่ยงเบนเฉลี่ย M.D. = 2.1960000000000024
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 2.20
*/

Stat = new Statistics(d.example8.set4.data);
Stat.showTable('t6');
console.log(Stat.standardDeviation());
/*
    ┌─────────┬───────────┬─────────────────────────────────────┬─────────────────────┐
    │ (index) │     x     │                x - x̄                │      (x - x̄)^2      │
    ├─────────┼───────────┼─────────────────────────────────────┼─────────────────────┤
    │    0    │  'ข้อมูล'   │           'ข้อมูล - ค่าเฉลี่ย'           │ '(ข้อมูล - ค่าเฉลี่ย)^2' │
    │    1    │     5     │         -1.2000000000000002         │ 1.4400000000000004  │
    │    2    │     5     │         -1.2000000000000002         │ 1.4400000000000004  │
    │    3    │     6     │        -0.20000000000000018         │ 0.04000000000000007 │
    │    4    │     7     │         0.7999999999999998          │ 0.6399999999999997  │
    │    5    │     8     │         1.7999999999999998          │ 3.2399999999999993  │
    │    6    │ 'Σx = 31' │ 'Σ(x - x̄) = -8.881784197001252e-16' │ 'Σ(x - x̄)^2 = 6.8'  │
    └─────────┴───────────┴─────────────────────────────────────┴─────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 5 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 6.2 ≈ 6.20
    - ส่วนเบี่ยงมาตราฐาน = 1.16619037896906 ≈ 1.17
    ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 1.1661903789690569
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 1.17
*/

Stat = new Statistics(d.example8.set5.data);
Stat.showTable('t6');
console.log(Stat.standardDeviation());
/*
    ┌─────────┬───────────┬─────────────────┬─────────────────────┐
    │ (index) │     x     │      x - x̄      │      (x - x̄)^2      │
    ├─────────┼───────────┼─────────────────┼─────────────────────┤
    │    0    │  'ข้อมูล'   │ 'ข้อมูล - ค่าเฉลี่ย' │ '(ข้อมูล - ค่าเฉลี่ย)^2' │
    │    1    │    13     │       -3        │          9          │
    │    2    │    16     │        0        │          0          │
    │    3    │    22     │        6        │         36          │
    │    4    │    10     │       -6        │         36          │
    │    5    │    15     │       -1        │          1          │
    │    6    │    20     │        4        │         16          │
    │    7    │ 'Σx = 96' │ 'Σ(x - x̄) = 0'  │  'Σ(x - x̄)^2 = 98'  │
    └─────────┴───────────┴─────────────────┴─────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 6 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 16 ≈ 16.00
    - ส่วนเบี่ยงมาตราฐาน = 4.041451884327381 ≈ 4.04
    ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 4.041451884327378
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 4.04
*/

Stat = new Statistics(d.example8.set6.data);
Stat.showTable('t6');
console.log(Stat.standardDeviation());
/*
    ┌─────────┬───────────┬─────────────────┬─────────────────────┐
    │ (index) │     x     │      x - x̄      │      (x - x̄)^2      │
    ├─────────┼───────────┼─────────────────┼─────────────────────┤
    │    0    │  'ข้อมูล'   │ 'ข้อมูล - ค่าเฉลี่ย' │ '(ข้อมูล - ค่าเฉลี่ย)^2' │
    │    1    │    15     │       4.5       │        20.25        │
    │    2    │    14     │       3.5       │        12.25        │
    │    3    │    10     │      -0.5       │        0.25         │
    │    4    │    12     │       1.5       │        2.25         │
    │    5    │    10     │      -0.5       │        0.25         │
    │    6    │     9     │      -1.5       │        2.25         │
    │    7    │     8     │      -2.5       │        6.25         │
    │    8    │     6     │      -4.5       │        20.25        │
    │    9    │ 'Σx = 84' │ 'Σ(x - x̄) = 0'  │  'Σ(x - x̄)^2 = 64'  │
    └─────────┴───────────┴─────────────────┴─────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 8 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 10.5 ≈ 10.50
    - ส่วนเบี่ยงมาตราฐาน = 2.8284271247461903 ≈ 2.83
    ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 2.8284271247461903
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 2.83
*/

Stat = new Statistics(d.example8.set7.data);
Stat.showTable('t6');
console.log(Stat.standardDeviation());
/*
    ┌─────────┬────────────┬─────────────────┬─────────────────────┐
    │ (index) │     x      │      x - x̄      │      (x - x̄)^2      │
    ├─────────┼────────────┼─────────────────┼─────────────────────┤
    │    0    │   'ข้อมูล'   │ 'ข้อมูล - ค่าเฉลี่ย' │ '(ข้อมูล - ค่าเฉลี่ย)^2' │
    │    1    │     67     │       -3        │          9          │
    │    2    │     68     │       -2        │          4          │
    │    3    │     69     │       -1        │          1          │
    │    4    │     70     │        0        │          0          │
    │    5    │     70     │        0        │          0          │
    │    6    │     72     │        2        │          4          │
    │    7    │     74     │        4        │         16          │
    │    8    │ 'Σx = 490' │ 'Σ(x - x̄) = 0'  │  'Σ(x - x̄)^2 = 34'  │
    └─────────┴────────────┴─────────────────┴─────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 7 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 70 ≈ 70.00
    - ส่วนเบี่ยงมาตราฐาน = 2.2038926600773587 ≈ 2.20
    ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 2.203892660077418
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 2.20
*/

Stat = new Statistics(d.example8.set8.data, d.example8.set8.frequency);
Stat.showTable('t6');
console.log(Stat.standardDeviation());
/*
    ┌─────────┬───────────┬──────────┬────────────────┬───────────────────────────────────┬────────────────────────────────┬─────────────────────────────┐
    │ (index) │     x     │    f     │       xf       │               x - x̄               │           (x - x̄)^2            │         f(x - x̄)^2          │
    ├─────────┼───────────┼──────────┼────────────────┼───────────────────────────────────┼────────────────────────────────┼─────────────────────────────┤
    │    0    │  'ข้อมูล'   │ 'ความถี่'  │ 'ข้อมูล x ความถี่' │        '(ข้อมูล - ค่าเฉลี่ย)^2'        │        'ข้อมูล - ค่าเฉลี่ย'         │ 'ความถี่ x (ข้อมูล - ค่าเฉลี่ย)^2' │
    │    1    │    10     │    2     │       20       │        37.210000000000015         │       -6.100000000000001       │      74.42000000000003      │
    │    2    │    13     │    3     │       39       │         9.610000000000008         │      -3.1000000000000014       │     28.830000000000027      │
    │    3    │    15     │    9     │      135       │         1.210000000000003         │      -1.1000000000000014       │     10.890000000000027      │
    │    4    │    20     │    4     │       80       │        15.209999999999988         │       3.8999999999999986       │     60.839999999999954      │
    │    5    │    24     │    2     │       48       │        62.409999999999975         │       7.899999999999999        │     124.81999999999995      │
    │    6    │ 'Σx = 82' │ 'n = 20' │  'Σxf = 322'   │ 'Σ(x - x̄)^2 = 125.64999999999998' │ 'Σ(x - x̄) = 1.499999999999993' │    'Σf(x - x̄)^2 = 299.8'    │
    └─────────┴───────────┴──────────┴────────────────┴───────────────────────────────────┴────────────────────────────────┴─────────────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 20 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 16.1 ≈ 16.10
    - ส่วนเบี่ยงเบนเฉลี่ย = 3.871692136521188 ≈ 3.87
    ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 3.871692136521182
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 3.87
*/

Stat = new Statistics([], d.example8.set9.frequency, d.example8.set9.classInterval);
Stat.showTable('t6');
console.log(Stat.standardDeviation());
/*
    ┌─────────┬─────────────┬──────────────┬───────────┬────────────────┬───────────────────────────────┬───────────────────────┬─────────────────────────────┐
    │ (index) │     ci      │      x       │     f     │       xf       │             x - x̄             │       (x - x̄)^2       │         f(x - x̄)^2          │
    ├─────────┼─────────────┼──────────────┼───────────┼────────────────┼───────────────────────────────┼───────────────────────┼─────────────────────────────┤
    │    0    │ 'อันตรภาคชั้น' │ 'จุดกึ่งกลางชั้น' │  'ความถี่'  │ 'ข้อมูล x ความถี่' │        'ข้อมูล - ค่าเฉลี่ย'        │  '(ข้อมูล - ค่าเฉลี่ย)^2'  │ 'ความถี่ x (ข้อมูล - ค่าเฉลี่ย)^2' │
    │    1    │  '40 - 44'  │      42      │     6     │      252       │      -13.899999999999999      │  193.20999999999995   │     1159.2599999999998      │
    │    2    │  '45 - 49'  │      47      │    16     │      752       │      -8.899999999999999       │   79.20999999999998   │     1267.3599999999997      │
    │    3    │  '50 - 54'  │      52      │    22     │      1144      │      -3.8999999999999986      │  15.209999999999988   │      334.6199999999997      │
    │    4    │  '55 - 59'  │      57      │    26     │      1482      │      1.1000000000000014       │   1.210000000000003   │      31.46000000000008      │
    │    5    │  '60 - 64'  │      62      │    14     │      868       │       6.100000000000001       │  37.210000000000015   │      520.9400000000002      │
    │    6    │  '65 - 69'  │      67      │    12     │      804       │      11.100000000000001       │  123.21000000000004   │     1478.5200000000004      │
    │    7    │  '70 - 74'  │      72      │     4     │      288       │             16.1              │  259.21000000000004   │     1036.8400000000001      │
    │    8    │    'รวม'    │  'Σx = 399'  │ 'n = 100' │  'Σxf = 5590'  │ 'Σ(x - x̄) = 7.70000000000001' │ 'Σ(x - x̄)^2 = 708.47' │      'Σf(x - x̄)^2 = 0'      │
    └─────────┴─────────────┴──────────────┴───────────┴────────────────┴───────────────────────────────┴───────────────────────┴─────────────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 100 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 55.9 ≈ 55.90
    - ส่วนเบี่ยงเบนเฉลี่ย = 0 ≈ 0.00
    ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 7.634788798650554
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 7.63
*/

let S = new Statistics(d.example8.set10.data);
S.showData();
let newS = new Statistics(d.example8.set10.data.map((i: number) => i += 3));
newS.showData();
console.log(`S ของข้อมูลชุดเก่า = ${S.standardDeviation()}\nS ของข้อมูลชุดใหม่ = ${newS.standardDeviation()}`);
/*
    ข้อมูลเดิมคือ 2 , 4 , 6 , 8 , 10
    เรียงข้อมูลชุดใหม่ได้ 2 , 4 , 6 , 8 , 10
    ข้อมูลเดิมคือ 5 , 7 , 9 , 11 , 13
    เรียงข้อมูลชุดใหม่ได้ 5 , 7 , 9 , 11 , 13
    S ของข้อมูลชุดเก่า = ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 2.8284271247461903
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 2.83
    S ของข้อมูลชุดใหม่ = ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 2.8284271247461903
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 2.83
*/

S = new Statistics(d.example8.set11.data);
S.showData();
newS = new Statistics(d.example8.set11.data.map((i: number) => i *= 3));
newS.showData();
console.log(`S ของข้อมูลชุดเก่า = ${S.standardDeviation()}\nS ของข้อมูลชุดใหม่ = ${newS.standardDeviation()}`);
/*
    ข้อมูลเดิมคือ 3 , 5 , 6 , 9 , 12
    เรียงข้อมูลชุดใหม่ได้ 3 , 5 , 6 , 9 , 12
    ข้อมูลเดิมคือ 9 , 15 , 18 , 27 , 36
    เรียงข้อมูลชุดใหม่ได้ 9 , 15 , 18 , 27 , 36
    S ของข้อมูลชุดเก่า = ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 3.1622776601683795
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 3.16
    S ของข้อมูลชุดใหม่ = ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 9.486832980505138
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 9.49
*/

Stat = new Statistics(d.example9.set1.data, d.example9.set1.frequency);
Stat.showTable('t6', 'คะแนน');
console.log(Stat.standardDeviation());
/*
    ┌─────────┬────────────┬──────────┬────────────────┬───────────────────────────────────┬────────────────────────────────┬────────────────────────────────────┐
    │ (index) │     x      │    f     │       xf       │               x - x̄               │           (x - x̄)^2            │             f(x - x̄)^2             │
    ├─────────┼────────────┼──────────┼────────────────┼───────────────────────────────────┼────────────────────────────────┼────────────────────────────────────┤
    │    0    │  'คะแนน'   │ 'ความถี่'  │ 'ข้อมูล x ความถี่' │        '(ข้อมูล - ค่าเฉลี่ย)^2'        │        'ข้อมูล - ค่าเฉลี่ย'         │    'ความถี่ x (ข้อมูล - ค่าเฉลี่ย)^2'     │
    │    1    │     15     │    1     │       15       │        30.617777777777796         │       -5.533333333333335       │         30.617777777777796         │
    │    2    │     17     │    4     │       68       │        12.484444444444456         │       -3.533333333333335       │         49.937777777777825         │
    │    3    │     20     │    6     │      120       │        0.2844444444444462         │       -0.533333333333335       │         1.7066666666666772         │
    │    4    │     25     │    3     │       75       │        19.951111111111096         │       4.466666666666665        │         59.85333333333329          │
    │    5    │     30     │    1     │       30       │         89.61777777777775         │       9.466666666666665        │         89.61777777777775          │
    │    6    │ 'Σx = 107' │ 'n = 15' │  'Σxf = 308'   │ 'Σ(x - x̄)^2 = 152.95555555555555' │ 'Σ(x - x̄) = 4.333333333333325' │ 'Σf(x - x̄)^2 = 231.73333333333335' │
    └─────────┴────────────┴──────────┴────────────────┴───────────────────────────────────┴────────────────────────────────┴────────────────────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 15 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 20.533333333333335 ≈ 20.53
    - ส่วนเบี่ยงเบนเฉลี่ย = 3.9305074594623135 ≈ 3.93
    ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 3.9305074594623024
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 3.93
*/

Stat = new Statistics([], d.example9.set2.frequency, d.example9.set2.classInterval);
Stat.showTable('t6', '', 'จำนวน', 'คะแนน');
console.log(Stat.standardDeviation());
/*
    ┌─────────┬───────────┬────────────┬───────────┬─────────────────┬────────────────────────────────┬──────────────────────────────────┬──────────────────────────────┐
    │ (index) │    ci     │     x      │     f     │       xf        │             x - x̄              │            (x - x̄)^2             │          f(x - x̄)^2          │
    ├─────────┼───────────┼────────────┼───────────┼─────────────────┼────────────────────────────────┼──────────────────────────────────┼──────────────────────────────┤
    │    0    │  'คะแนน'  │  'คะแนน'   │  'จำนวน'  │ 'คะแนน x จำนวน' │        'คะแนน - ค่าเฉลี่ย'        │       '(คะแนน - ค่าเฉลี่ย)^2'       │ 'จำนวน x (คะแนน - ค่าเฉลี่ย)^2' │
    │    1    │ '20 - 26' │     23     │    10     │       230       │             -16.14             │        260.49960000000004        │      2604.9960000000005      │
    │    2    │ '27 - 33' │     30     │    14     │       420       │             -9.14              │        83.53960000000001         │          1169.5544           │
    │    3    │ '34 - 36' │     35     │    16     │       560       │       -4.140000000000001       │        17.139600000000005        │      274.2336000000001       │
    │    4    │ '37 - 39' │     38     │    20     │       760       │      -1.1400000000000006       │        1.2996000000000012        │      25.992000000000026      │
    │    5    │ '40 - 46' │     43     │    18     │       774       │       3.8599999999999994       │        14.899599999999996        │      268.1927999999999       │
    │    6    │ '47 - 53' │     50     │    12     │       600       │             10.86              │        117.93959999999998        │      1415.2751999999998      │
    │    7    │ '54 - 60' │     57     │    10     │       570       │             17.86              │             318.9796             │      3189.7960000000003      │
    │    8    │   'รวม'   │ 'Σx = 276' │ 'n = 100' │  'Σxf = 3914'   │ 'Σ(x - x̄) = 2.019999999999996' │ 'Σ(x - x̄)^2 = 814.2972000000001' │   'Σf(x - x̄)^2 = 8948.04'    │
    └─────────┴───────────┴────────────┴───────────┴─────────────────┴────────────────────────────────┴──────────────────────────────────┴──────────────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 100 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 39.14 ≈ 39.14
    - ส่วนเบี่ยงมาตราฐาน = 9.45940801530413 ≈ 9.46
    ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 9.459408015304124
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 9.46
*/

Stat = new Statistics([], d.example9.set3.frequency, d.example9.set3.classInterval);
Stat.showTable('t6', '', 'จำนวนวันหยุด', 'จำนวนนักเรียน');
console.log(Stat.standardDeviation());
console.log(Stat.variance());
/*
    ┌─────────┬───────────────┬───────────────┬──────────────┬────────────────────────────┬─────────────────────────────────┬────────────────────────────┬─────────────────────────────────────────┐
    │ (index) │      ci       │       x       │      f       │             xf             │              x - x̄              │         (x - x̄)^2          │               f(x - x̄)^2                │
    ├─────────┼───────────────┼───────────────┼──────────────┼────────────────────────────┼─────────────────────────────────┼────────────────────────────┼─────────────────────────────────────────┤
    │    0    │ 'จำนวนนักเรียน' │ 'จำนวนนักเรียน' │ 'จำนวนวันหยุด' │ 'จำนวนนักเรียน x จำนวนวันหยุด' │     'จำนวนนักเรียน - ค่าเฉลี่ย'      │ '(จำนวนนักเรียน - ค่าเฉลี่ย)^2' │ 'จำนวนวันหยุด x (จำนวนนักเรียน - ค่าเฉลี่ย)^2' │
    │    1    │    '0 - 2'    │       1       │      15      │             15             │              -3.24              │     10.497600000000002     │           157.46400000000003            │
    │    2    │    '3 - 5'    │       4       │      20      │             80             │       -0.2400000000000002       │     0.0576000000000001     │           1.1520000000000021            │
    │    3    │    '6 - 8'    │       7       │      12      │             84             │              2.76               │     7.617599999999999      │            91.41119999999998            │
    │    4    │   '9 - 11'    │      10       │      2       │             20             │              5.76               │          33.1776           │                 66.3552                 │
    │    5    │   '12 - 14'   │      13       │      1       │             13             │              8.76               │          76.7376           │                 76.7376                 │
    │    6    │     'รวม'     │   'Σx = 35'   │   'n = 50'   │        'Σxf = 212'         │ 'Σ(x - x̄) = 13.799999999999999' │   'Σ(x - x̄)^2 = 128.088'   │         'Σf(x - x̄)^2 = 393.12'          │
    └─────────┴───────────────┴───────────────┴──────────────┴────────────────────────────┴─────────────────────────────────┴────────────────────────────┴─────────────────────────────────────────┘
            สรุปข้อมูลในตาราง
    - จำนวนข้อมูลทั้งหมด = 50 จำนวน
    - ค่าเฉลี่ยเลขคณิต = 4.24 ≈ 4.24
    - ส่วนเบี่ยงมาตราฐาน = 2.8039971469315015 ≈ 2.80
    ส่วนเบี่ยงเบนเฉลี่ยมาตราฐาน S.D. = 2.803997146931501
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 2.80
    ความแปรปรวนของข้อมูล S^2 = 7.862399999999997
    ปัดเป็นทศนิยม 2 ตำแหน่ง ≈ 7.86
*/

E = new Extension(d.example9.set4.dataA, d.example9.set4.dataB);
console.log(E.compareTheCoefficientOfRange());
/*
    ข้อมูล A = 71 , 72 , 73 , 74 , 75 , 76
    ข้อมูล B = 110 , 112 , 115 , 116 , 117 , 118
    สัมประสิทธิ์ของพิสัย C.R ของข้อมูล A = 0.034013605442176874 ≈ 0.034
    สัมประสิทธิ์ของพิสัย C.R ของข้อมูล B = 0.03508771929824561 ≈ 0.035
    ข้อมูล A มีการกระจายมากกว่าข้อมูล B
*/

E = new Extension(d.example9.set5.dataA.classInterval, d.example9.set5.dataB.classInterval);
console.log(E.compareTheCoefficientOfRange());
/*
    ข้อมูล A = 6 , 10 , 11 , 15 , 16 , 20 , 21 , 25 , 26 , 30
    ข้อมูล B = 20 , 24 , 25 , 29 , 30 , 34 , 35 , 39 , 40 , 44
    สัมประสิทธิ์ของพิสัย C.R ของข้อมูล A = 0.6944444444444444 ≈ 0.694
    สัมประสิทธิ์ของพิสัย C.R ของข้อมูล B = 0.390625 ≈ 0.391
    ข้อมูล A มีการกระจายมากกว่าข้อมูล B
*/
E = new Extension(d.example9.set5.dataB.classInterval, d.example9.set5.dataC.classInterval);
console.log(E.compareTheCoefficientOfRange());
/*
    ข้อมูล A = 20 , 24 , 25 , 29 , 30 , 34 , 35 , 39 , 40 , 44
    ข้อมูล B = 30 , 39 , 40 , 49 , 50 , 59 , 60 , 69 , 70 , 79
    สัมประสิทธิ์ของพิสัย C.R ของข้อมูล A = 0.390625 ≈ 0.391
    สัมประสิทธิ์ของพิสัย C.R ของข้อมูล B = 0.45871559633027525 ≈ 0.459
    ข้อมูล B มีการกระจายมากกว่าข้อมูล A
*/
E = new Extension(d.example9.set5.dataA.classInterval, d.example9.set5.dataC.classInterval);
console.log(E.compareTheCoefficientOfRange());
/*
    ข้อมูล A = 6 , 10 , 11 , 15 , 16 , 20 , 21 , 25 , 26 , 30
    ข้อมูล B = 30 , 39 , 40 , 49 , 50 , 59 , 60 , 69 , 70 , 79
    สัมประสิทธิ์ของพิสัย C.R ของข้อมูล A = 0.6944444444444444 ≈ 0.694
    สัมประสิทธิ์ของพิสัย C.R ของข้อมูล B = 0.45871559633027525 ≈ 0.459
    ข้อมูล A มีการกระจายมากกว่าข้อมูล B
*/

E = new Extension(d.example9.set6.dataA, d.example9.set6.dataB);
console.log(E.compareTheCoefficientOfQuartileDeviation());
/*
    ข้อมูล A = 51 , 54 , 56 , 58 , 59 , 59 , 60 , 65 , 69 , 87
    ข้อมูล B = 0 , 64 , 66 , 66 , 69 , 70 , 70 , 71 , 75 , 85
    สัมประสิทธิ์องส่วนเบี่ยงเบนควอร์ไทล์ C.QD ของข้อมูล A = 0.08641975308641975 ≈ 0.0864
    สัมประสิทธิ์องส่วนเบี่ยงเบนควอร์ไทล์ C.QD ของข้อมูล B = 0.04727272727272727 ≈ 0.0473
    ข้อมูล A มีการกระจายมากกว่าข้อมูล B
*/

E = new Extension(d.example9.set7.classInterval, d.example9.set7.classInterval, d.example9.set7.frequencyA, d.example9.set7.frequencyB);
console.log(E.compareTheCoefficientOfQuartileDeviation());
/*
    ข้อมูล A = 140 , 144 , 145 , 149 , 150 , 154 , 155 , 159 , 160 , 164 , 165 , 169 , 170 , 174
    ความถี่ A = 2 , 4 , 10 , 13 , 16 , 9 , 6
    ความถี่สะสม A = 2 , 6 , 16 , 29 , 45 , 54 , 60 , 6 , 16 , 29 , 45 , 54 , 60
    ข้อมูล B = 140 , 144 , 145 , 149 , 150 , 154 , 155 , 159 , 160 , 164 , 165 , 169 , 170 , 174
    ความถี่ B = 1 , 4 , 6 , 9 , 5 , 3 , 2
    ความถี่สะสม B = 1 , 5 , 11 , 20 , 25 , 28 , 30 , 5 , 11 , 20 , 25 , 28 , 30
    สัมประสิทธิ์องส่วนเบี่ยงเบนควอร์ไทล์ C.QD ของข้อมูล A = 0.03296703296703297 ≈ 0.0330
    สัมประสิทธิ์องส่วนเบี่ยงเบนควอร์ไทล์ C.QD ของข้อมูล B = 0.03321817698644695 ≈ 0.0332
    ข้อมูล B มีการกระจายมากกว่าข้อมูล A
*/

E = new Extension(d.example9.set8.dataA, d.example9.set8.dataB);
console.log(E.compareTheCoefficientOfMeanDeviation());
/*
    ข้อมูล A = 40 , 44 , 48 , 51 , 55 , 62
    ข้อมูล B = 65 , 68 , 69 , 75 , 81 , 86
    สัมประสิทธิ์ของส่วนเบี่ยงเบนเฉลี่ย C.MD ของข้อมูล A = 0.12 ≈ 0.120
    สัมประสิทธิ์ของส่วนเบี่ยงเบนเฉลี่ย C.MD ของข้อมูล B = 0.0900900900900901 ≈ 0.090
    ข้อมูล A มีการกระจายมากกว่าข้อมูล B
*/

E = new Extension(d.example9.set9.dataA, d.example9.set9.dataB);
console.log(E.compareTheCoefficientOfDeviation());
/*
    ข้อมูล A = 40 , 44 , 48 , 51 , 55 , 62
    ข้อมูล B = 65 , 68 , 69 , 75 , 81 , 86
    สัมประสิทธิ์ของการแปรผัน C.SD ของข้อมูล A = 0.14375905768565217 ≈ 0.144
    สัมประสิทธิ์ของการแปรผัน C.SD ของข้อมูล B = 0.10112587531821463 ≈ 0.101
    ข้อมูล A มีการกระจายมากกว่าข้อมูล B
*/
